#lang racket

; Задача 4. Да се напише функция maximize, която получава непразен списък от
; едноместни числови функции и връща нова едноместна числова функция на
; аргумент x, която връща стойността f(x) на тази фунция f от списъка, за която
; числото f(x) е най-голямо по абсолютна стойност.

(define (maximize lst)
  (λ (x) (foldl (λ (curr acc) (if (> (abs curr) (abs acc)) curr acc)) 0 (map (λ (y) (y x)) lst))))

((maximize (list (λ (x) (- x 10)) (λ (x) (- x 5)))) 5)
((maximize (list (λ (x) (- x 10)) (λ (x) (- x 5)))) 9)